def f21(x):
    if x[2] == 'c++':
        if x[3] == 'json':
            return {1975: 0, 1988: 1, 2002: 2}[x[0]]
        elif x[3] == 'x10':
            return {'java': 3, 'volt': 4, 'rhtml': 5}[x[4]]

    elif x[2] == 'gdb':
        if x[3] == 'json':
            return 6
        elif x[3] == 'x10':
            return 7

    elif x[2] == 'java':
        if x[3] == 'json':
            if x[4] == 'java':
                return {2007: 8, 2014: 9}[x[1]]
            elif x[4] == 'volt':
                return 10
            elif x[4] == 'rhtml':
                return 11
        elif x[3] == 'x10':
            return 12


# print(f21([1988, 2007, 'java', 'x10', 'java']))
# print(f21([1988, 2014, 'java', 'json', 'java']))


def f22(x):
    F = x & 0x80000000;
    F >>= 1
    E = x & 0x40000000;
    E <<= 1
    DCB = x & 0x3fffffe0;
    DCB >>= 5
    A = x & 0x0000001f;
    A <<= 25
    return A | DCB | E | F


# print(hex(f22(0xe69d197c)))
# print(hex(f22(0x4c39f8df)))


def f23(m):
    def unicify(matrix):
        first, current = 0, 1
        while first != len(matrix) - 1:
            while current != len(matrix):
                if matrix[first] == matrix[current]:
                    matrix.pop(current)
                else:
                    current += 1
            first += 1
            current = first + 1
        return matrix

    def transpose(matrix):
        matrix = list(zip(*matrix))
        for i in range(len(matrix)):
            matrix[i] = list(matrix[i])
        return matrix

    for line in m:
        line.pop(2)
        line.pop(2)
        line.pop(2)
        line[0] = 'Нет' if line[0] == '0' else 'Да'
        line[1] = '/'.join(line[1].split('-')[::-1])  # '04-10-03' -> '03/10/04'
        line[2] = line[2][:len(line[2]) - 5]  # 'XXX X.X.' -> 'XXX'
    m = unicify(m)
    return transpose(m)

#
# tests = [([['0', '04-10-03', None, None, '04-10-03', 'Верев С.А.'],
#            ['0', '04-10-03', None, None, '04-10-03', 'Верев С.А.'],
#            ['0', '04-10-03', None, None, '04-10-03', 'Верев С.А.'],
#            ['1', '03-05-04', None, None, '03-05-04', 'Богогман А.Б.'],
#            ['0', '02-03-03', None, None, '02-03-03', 'Буридман П.В.']],
#           [['Нет', 'Да', 'Нет'], ['03/10/04', '04/05/03', '03/03/02'], ['Верев', 'Богогман', 'Буридман']]),
#          ([['0', '05-02-00', None, None, '05-02-00', 'Бочман П.Л.'],
#            ['0', '04-06-01', None, None, '04-06-01', 'Тифисман И.У.'],
#            ['0', '05-02-00', None, None, '05-02-00', 'Бочман П.Л.'],
#            ['0', '05-02-00', None, None, '05-02-00', 'Бочман П.Л.'],
#            ['0', '28-10-99', None, None, '28-10-99', 'Шорян С.В.']],
#           [['Нет', 'Нет', 'Нет'], ['00/02/05', '01/06/04', '99/10/28'], ['Бочман', 'Тифисман', 'Шорян']]), (
#          [['1', '28-04-01', None, None, '28-04-01', 'Колак Т.З.'],
#           ['0', '12-01-01', None, None, '12-01-01', 'Зодешман Д.Н.'],
#           ['0', '12-01-01', None, None, '12-01-01', 'Зодешман Д.Н.'],
#           ['0', '12-01-01', None, None, '12-01-01', 'Зодешман Д.Н.'],
#           ['0', '15-09-01', None, None, '15-09-01', 'Финич М.В.']],
#          [['Да', 'Нет', 'Нет'], ['01/04/28', '01/01/12', '01/09/15'], ['Колак', 'Зодешман', 'Финич']]), (
#          [['1', '07-06-04', None, None, '07-06-04', 'Цакериди Р.К.'],
#           ['1', '02-05-04', None, None, '02-05-04', 'Зизян Т.Е.'],
#           ['1', '02-03-03', None, None, '02-03-03', 'Зинилянц Ф.К.'],
#           ['1', '07-06-04', None, None, '07-06-04', 'Цакериди Р.К.'],
#           ['1', '07-06-04', None, None, '07-06-04', 'Цакериди Р.К.']],
#          [['Да', 'Да', 'Да'], ['04/06/07', '04/05/02', '03/03/02'], ['Цакериди', 'Зизян', 'Зинилянц']]), (
#          [['0', '23-10-03', None, None, '23-10-03', 'Балорич С.И.'],
#           ['1', '24-09-99', None, None, '24-09-99', 'Чоший А.Д.'],
#           ['0', '14-07-02', None, None, '14-07-02', 'Гикяк Е.З.'],
#           ['0', '23-10-03', None, None, '23-10-03', 'Балорич С.И.'],
#           ['0', '23-10-03', None, None, '23-10-03', 'Балорич С.И.']],
#          [['Нет', 'Да', 'Нет'], ['03/10/23', '99/09/24', '02/07/14'], ['Балорич', 'Чоший', 'Гикяк']]), (
#          [['0', '13-03-00', None, None, '13-03-00', 'Дагонский В.Н.'],
#           ['0', '13-03-00', None, None, '13-03-00', 'Дагонский В.Н.'],
#           ['1', '12-11-00', None, None, '12-11-00', 'Чушев Т.Л.'],
#           ['0', '02-01-04', None, None, '02-01-04', 'Шибич В.Л.'],
#           ['0', '13-03-00', None, None, '13-03-00', 'Дагонский В.Н.']],
#          [['Нет', 'Да', 'Нет'], ['00/03/13', '00/11/12', '04/01/02'], ['Дагонский', 'Чушев', 'Шибич']]), (
#          [['0', '17-11-00', None, None, '17-11-00', 'Сизуфук Д.О.'],
#           ['0', '05-09-02', None, None, '05-09-02', 'Ноцов Ю.Д.'],
#           ['1', '21-05-02', None, None, '21-05-02', 'Нумисли О.Т.'],
#           ['0', '17-11-00', None, None, '17-11-00', 'Сизуфук Д.О.'],
#           ['0', '17-11-00', None, None, '17-11-00', 'Сизуфук Д.О.']],
#          [['Нет', 'Нет', 'Да'], ['00/11/17', '02/09/05', '02/05/21'], ['Сизуфук', 'Ноцов', 'Нумисли']]), (
#          [['1', '02-10-04', None, None, '02-10-04', 'Зуцберг М.Л.'],
#           ['1', '02-10-04', None, None, '02-10-04', 'Зуцберг М.Л.'],
#           ['1', '02-10-04', None, None, '02-10-04', 'Зуцберг М.Л.'],
#           ['0', '01-02-01', None, None, '01-02-01', 'Дочиди Ф.Ц.'],
#           ['0', '03-11-02', None, None, '03-11-02', 'Нимерий А.Т.'],
#           ['0', '27-11-01', None, None, '27-11-01', 'Гумский М.Е.']],
#          [['Да', 'Нет', 'Нет', 'Нет'], ['04/10/02', '01/02/01', '02/11/03', '01/11/27'], ['Зуцберг', 'Дочиди', 'Нимерий', 'Гумский']])]
# for test in tests:
#     q = f23(test[0])
#     if q == test[1]:
#         print("OK")
#     else:
#         print("ERROR")
#         print(f23(test[0]))
#         print(test[1])
